{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //STEP 17: GENERATE DATASET WITH DISCRETE TIME HAZARDS: 2 YR INTERVALS: FRIDAY PLUS CORRECT FIGURES USING SAMPLING WEIGHTS (K-M and Error bar) //
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT_ABN_SMALL",clear
{txt}
{com}. 
. sort HHIDPN
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT_ABN_SMALL",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT_ABN_SMALL.dta{rm}
saved
{p_end}

{com}. 
. 
. * Step 1: Expand the dataset
. capture drop period
{txt}
{com}. gen period = floor(_t / 2) + 1  // Create time periods based on 2-year intervals
{txt}
{com}. expand period  // Expand the dataset for each time period
{txt}(3,802 observations created)

{com}. 
. * Step 2: Create time variables for analysis
. capture drop start_time
{txt}
{com}. capture drop end_time
{txt}
{com}. 
. bysort HHIDPN: gen start_time = (_n - 1) * 2  // Start of each 2-year period
{txt}
{com}. bysort HHIDPN: gen end_time = start_time + 2  // End of each 2-year period
{txt}
{com}. 
. * Step 3: Indicate event occurrence in each period
. capture drop event
{txt}
{com}. 
. gen event = (_d == 1 & _t <= end_time & _t > start_time)
{txt}
{com}. 
. * Step 4: Create dummy variables for each 2-year interval
. gen interval = floor(start_time / 2) + 1  // Create interval number
{txt}
{com}. tabulate interval, generate(dummy)  // Generate dummy variables for each interval

   {txt}interval {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,413       27.09       27.09
{txt}          2 {c |}{res}      1,369       26.25       53.35
{txt}          3 {c |}{res}      1,282       24.58       77.93
{txt}          4 {c |}{res}      1,151       22.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      5,215      100.00
{txt}
{com}. 
. 
. logistic _d dummy1-dummy4 AGE SEX NHB HISP OTHER zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm frail_status  zses
{txt}note: {bf:dummy4} omitted because of collinearity.
{res}
{txt}{col 1}Logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:5,215}
{txt}{col 56}{lalign 13:LR chi2({res:15})}{col 69} = {res}{ralign 7:1215.76}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1414.8122}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.3005}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             _d{col 17}{c |} Odds ratio{col 29}   Std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}dummy1 {c |}{col 17}{res}{space 2} 8.397576{col 29}{space 2} 1.719183{col 40}{space 1}   10.39{col 49}{space 3}0.000{col 57}{space 4} 5.622026{col 70}{space 3} 12.54339
{txt}{space 9}dummy2 {c |}{col 17}{res}{space 2} 7.143661{col 29}{space 2} 1.475859{col 40}{space 1}    9.52{col 49}{space 3}0.000{col 57}{space 4} 4.765024{col 70}{space 3} 10.70968
{txt}{space 9}dummy3 {c |}{col 17}{res}{space 2} 4.551358{col 29}{space 2} .9703917{col 40}{space 1}    7.11{col 49}{space 3}0.000{col 57}{space 4} 2.996794{col 70}{space 3} 6.912339
{txt}{space 9}dummy4 {c |}{col 17}{res}{space 2}        1{col 29}{txt}  (omitted)
{space 12}AGE {c |}{col 17}{res}{space 2} 1.115259{col 29}{space 2}  .006714{col 40}{space 1}   18.12{col 49}{space 3}0.000{col 57}{space 4} 1.102177{col 70}{space 3} 1.128496
{txt}{space 12}SEX {c |}{col 17}{res}{space 2} .7884807{col 29}{space 2} .0878082{col 40}{space 1}   -2.13{col 49}{space 3}0.033{col 57}{space 4} .6338668{col 70}{space 3} .9808082
{txt}{space 12}NHB {c |}{col 17}{res}{space 2} .9358844{col 29}{space 2} .1430317{col 40}{space 1}   -0.43{col 49}{space 3}0.665{col 57}{space 4} .6936377{col 70}{space 3} 1.262734
{txt}{space 11}HISP {c |}{col 17}{res}{space 2} .3089288{col 29}{space 2} .0605963{col 40}{space 1}   -5.99{col 49}{space 3}0.000{col 57}{space 4} .2103272{col 70}{space 3}  .453755
{txt}{space 10}OTHER {c |}{col 17}{res}{space 2} .7845095{col 29}{space 2} .3142479{col 40}{space 1}   -0.61{col 49}{space 3}0.545{col 57}{space 4} .3577963{col 70}{space 3} 1.720127
{txt}{space 1}zHorvathAgeEAA {c |}{col 17}{res}{space 2} .8894865{col 29}{space 2}  .047074{col 40}{space 1}   -2.21{col 49}{space 3}0.027{col 57}{space 4} .8018469{col 70}{space 3} .9867048
{txt}{space 2}zHannumAgeEAA {c |}{col 17}{res}{space 2} 1.202091{col 29}{space 2} .0699154{col 40}{space 1}    3.16{col 49}{space 3}0.002{col 57}{space 4} 1.072581{col 70}{space 3} 1.347238
{txt}{space 3}zPhenoAgeEAA {c |}{col 17}{res}{space 2} 1.080308{col 29}{space 2} .0609432{col 40}{space 1}    1.37{col 49}{space 3}0.171{col 57}{space 4} .9672282{col 70}{space 3} 1.206608
{txt}zGrimAgeMortEAA {c |}{col 17}{res}{space 2} 1.316068{col 29}{space 2} .0962344{col 40}{space 1}    3.76{col 49}{space 3}0.000{col 57}{space 4} 1.140345{col 70}{space 3} 1.518869
{txt}{space 3}zDunedinPoAm {c |}{col 17}{res}{space 2} 1.143086{col 29}{space 2} .0732907{col 40}{space 1}    2.09{col 49}{space 3}0.037{col 57}{space 4} 1.008098{col 70}{space 3} 1.296149
{txt}{space 3}frail_status {c |}{col 17}{res}{space 2} 2.429887{col 29}{space 2} .2494712{col 40}{space 1}    8.65{col 49}{space 3}0.000{col 57}{space 4} 1.986987{col 70}{space 3} 2.971509
{txt}{space 11}zses {c |}{col 17}{res}{space 2} .5570117{col 29}{space 2} .0325306{col 40}{space 1}  -10.02{col 49}{space 3}0.000{col 57}{space 4} .4967667{col 70}{space 3} .6245628
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 7.53e-06{col 29}{space 2} 3.89e-06{col 40}{space 1}  -22.85{col 49}{space 3}0.000{col 57}{space 4} 2.74e-06{col 70}{space 3} .0000207
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. 
. sort HHIDPN 
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT_ABN__DISCRETE",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT_ABN__DISCRETE.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT_ABN__DISCRETE",clear
{txt}
{com}. 
. capture rename _d d_var
{txt}
{com}. 
. 
. keep AGE  zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm frail_status zses SEX d_var NHB HISP OTHER dummy1 dummy2 dummy3 dummy4 
{txt}
{com}. 
. destring(AGE),replace
{txt}AGE already numeric; no {res}replace
{txt}
{com}. 
. 
. order AGE  zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm frail_status SEX d_var NHB HISP OTHER dummy1 dummy2 dummy3 dummy4 zses
{txt}
{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT_ABN_DISCRETEfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT_ABN_DISCRETEfin.dta{rm}
saved
{p_end}

{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}