{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. ****************************************STEP 7: MERGE WITH EPIGENETIC,  DIETARY DATA AND FRAILTY DATA *******************************************************************************
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT.dta",clear
{txt}
{com}. capture rename hhidpn HHIDPN
{txt}
{com}. sort HHIDPN
{txt}
{com}. capture drop _merge
{txt}
{com}. su HHIDPN

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}HHIDPN {c |}{res}     46,851    3.11e+07    2.53e+07        110   9.60e+07
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT.dta", replace 
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\EPICLOCKA_R.dta",clear
{txt}
{com}. destring HHID, replace
{txt}HHID already numeric; no {res}replace
{txt}
{com}. destring PN, replace
{txt}PN already numeric; no {res}replace
{txt}
{com}. 
. capture drop HHIDPN
{txt}
{com}. egen HHIDPN = concat(HHID PN)
{txt}
{com}. 
. destring HHIDPN, replace
{txt}HHIDPN: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. sort HHIDPN
{txt}
{com}. 
. su HHIDPN

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}HHIDPN {c |}{res}      4,018    3.34e+07    2.95e+07    1003810   9.53e+07
{txt}
{com}. 
. **    Variable |        Obs        Mean    Std. dev.       Min        Max
. **-------------+---------------------------------------------------------
. **      HHIDPN |      4,018    3.34e+07    2.95e+07    1003810   9.53e+07
. 
. 
. capture drop _merge
{txt}
{com}. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\EPICLOCKA_R.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\EPICLOCKA_R.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_FRAILTY",clear
{txt}
{com}. sort HHIDPN
{txt}
{com}. capture drop _merge
{txt}
{com}. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_FRAILTY",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_FRAILTY.dta{rm}
saved
{p_end}

{com}. 
. 
. **Start the merging here**
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORT.dta", replace 
{txt}
{com}. merge HHIDPN using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\EPICLOCKA_R.dta"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     42,833       91.42       91.42
{txt}          3 {c |}{res}      4,018        8.58      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HHIDPN
{txt}
{com}. merge HHIDPN using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HEI2015"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     38,818       82.85       82.85
{txt}          2 {c |}{res}          2        0.00       82.85
{txt}          3 {c |}{res}      8,033       17.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,853      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HHIDPN
{txt}
{com}. merge HHIDPN using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_FRAILTY"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     25,943       55.37       55.37
{txt}          2 {c |}{res}          2        0.00       55.37
{txt}          3 {c |}{res}     20,910       44.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,855      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HHIDPN
{txt}
{com}. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORTfin.dta", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HRS\HRS_TLHEIFRAILEPIGENMORTfin.dta{rm}
saved
{p_end}

{com}. 
. 
. ***@@@@@GENERATE frail_status variable from here onwards and include in K-M curve etc.@@@@@
. *****************************************************************************************************************
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}