{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. //STEP 11: KAPLAN MEIER SURVIVAL CURVES BY TERTILES OF EACH EPIGENETIC CLOCK, EPIGENETIC EAA AND TL VARIABLES//
. 
. capture drop zfrailty_score zses
{txt}
{com}. foreach x of varlist frailty_score ses {c -(}
{txt}  2{com}.         egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-} 
{txt}(19,468 missing values generated)
(19,468 missing values generated)

{com}. 
. capture drop zHorvathAgeEAAtert zHannumAgeEAAtert zPhenoAgeEAAtert zGrimAgeMortEAAtert zDunedinPoAmtert zsestert
{txt}
{com}. 
. foreach var of varlist zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm zses  {c -(}
{txt}  2{com}.         xtile `var'tert=`var' if sample_final==1,nq(3)
{txt}  3{com}. 
. {c )-}
{txt}
{com}. 
. 
. tab1 *tert 

{res}-> tabulation of zHorvathAgeEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zHorvathAge {c |}
       EAA  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        513       33.38       33.38
{txt}          2 {c |}{res}        512       33.31       66.69
{txt}          3 {c |}{res}        512       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,537      100.00

-> tabulation of zHannumAgeEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zHannumAgeE {c |}
        AA  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        513       33.38       33.38
{txt}          2 {c |}{res}        512       33.31       66.69
{txt}          3 {c |}{res}        512       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,537      100.00

-> tabulation of zPhenoAgeEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zPhenoAgeEA {c |}
         A  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        513       33.38       33.38
{txt}          2 {c |}{res}        512       33.31       66.69
{txt}          3 {c |}{res}        512       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,537      100.00

-> tabulation of zGrimAgeMortEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zGrimAgeMor {c |}
      tEAA  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        513       33.38       33.38
{txt}          2 {c |}{res}        512       33.31       66.69
{txt}          3 {c |}{res}        512       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,537      100.00

-> tabulation of zDunedinPoAmtert  

{txt}3 quantiles {c |}
         of {c |}
zDunedinPoA {c |}
         m  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        513       33.38       33.38
{txt}          2 {c |}{res}        512       33.31       66.69
{txt}          3 {c |}{res}        512       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,537      100.00

-> tabulation of zsestert  

{txt}3 quantiles {c |}
   of zses  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        513       33.38       33.38
{txt}          2 {c |}{res}        512       33.31       66.69
{txt}          3 {c |}{res}        512       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,537      100.00
{txt}
{com}. 
. 
. foreach var of varlist *tert frailty_status {c -(}
{txt}  2{com}.         sts test `var'
{txt}  3{com}. {c )-}
{txt}note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zHorvathAg~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}7293842.31     8032146.49       0.9115
           {txt}2 {c |}{res}7359013.25     7576632.67       0.9750
           {txt}3 {c |}{res}9304412.26     8348488.64       1.1188
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  2.40e+07       2.40e+07       1.0000

                               {txt}Wald chi2(2) =   {res}3.46
                               {txt}Pr>chi2      = {res}0.1773

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zHorvathAgeEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zHannumAge~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}6884837.67     9310434.33       0.7625
           {txt}2 {c |}{res}7994294.89     8027613.09       1.0273
           {txt}3 {c |}{res}9078135.26     6619220.38       1.4173
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  2.40e+07       2.40e+07       1.0000

                               {txt}Wald chi2(2) =  {res}28.28
                               {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zHannumAgeEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zPhenoAgeE~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}7259792.32     8987466.36       0.8222
           {txt}2 {c |}{res}7546408.55     7809134.46       0.9837
           {txt}3 {c |}{res}9151066.95     7160666.99       1.3017
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  2.40e+07       2.40e+07       1.0000

                               {txt}Wald chi2(2) =  {res}17.06
                               {txt}Pr>chi2      = {res}0.0002

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zPhenoAgeEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zGrimAgeMo~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}7054073.02       1.03e+07       0.7180
           {txt}2 {c |}{res}7678420.88     7523507.95       1.0770
           {txt}3 {c |}{res}9224773.93     6088844.40       1.6021
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  2.40e+07       2.40e+07       1.0000

                               {txt}Wald chi2(2) =  {res}47.77
                               {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zGrimAgeMortEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zDunedinPo~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}6590438.94     9656983.55       0.7179
           {txt}2 {c |}{res}7680901.42     7900663.63       1.0245
           {txt}3 {c |}{res}9685927.46     6399620.62       1.6005
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  2.40e+07       2.40e+07       1.0000

                               {txt}Wald chi2(2) =  {res}50.23
                               {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zDunedinPoAmtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 9} {c |}  Observed       Expected     Relative
zsestert {c |}    events         events       hazard
{hline 9}{c +}{hline 38}
       1 {c |}{res}5151137.16     3881279.19       1.3863
       {txt}2 {c |}{res}  1.00e+07     7863641.93       1.3308
       {txt}3 {c |}{res}8786061.41       1.22e+07       0.7499
{txt}{hline 9}{c +}{hline 38}
   Total {c |}{res}  2.40e+07       2.40e+07       1.0000

                           {txt}Wald chi2(2) =  {res}36.80
                           {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 51}Note: Reporting Wald model test from Cox regression on {bf:zsestert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
frailty_st~s {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           0 {c |}{res}  1.92e+07       2.12e+07       0.9172
           {txt}1 {c |}{res}7831640.12     5793919.27       1.3724
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  2.70e+07       2.70e+07       1.0000

                               {txt}Wald chi2(1) =  {res}14.57
                               {txt}Pr>chi2      = {res}0.0001

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:frailty_status}.{p_end}

{com}. 
. 
. foreach var of varlist *tert frailty_status {c -(}
{txt}  2{com}.         sts graph, by(`var')
{txt}  3{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1`var'.gph",replace
{txt}  4{com}. {c )-} 

{col 9}{txt}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zHorvathAgeEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zHannumAgeEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zPhenoAgeEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zGrimAgeMortEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zDunedinPoAmtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zsestert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1frailty_status.gph} saved

{com}. 
. graph combine "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zHorvathAgeEAAtert.gph" ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zDunedinPoAmtert.gph" ////
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zGrimAgeMortEAAtert.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zHannumAgeEAAtert.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zPhenoAgeEAAtert.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1frailty_status.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zsestert.gph"  ///
> 
{res}{txt}
{com}. 
. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1combined.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1combined.gph} saved

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}