{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //STEP 17: GENERATE DATASET WITH DISCRETE TIME HAZARDS: 2 YR INTERVALS: FRIDAY PLUS CORRECT FIGURES USING SAMPLING WEIGHTS (K-M and Error bar) //
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_SMALL",clear
{txt}
{com}. 
. sort seqn
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_SMALL",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_SMALL.dta{rm}
saved
{p_end}

{com}. 
. 
. * Step 1: Expand the dataset
. capture drop period
{txt}
{com}. gen period = floor(_t / 2) + 1  // Create time periods based on 2-year intervals
{txt}
{com}. expand period  // Expand the dataset for each time period
{txt}(9,691 observations created)

{com}. 
. * Step 2: Create time variables for analysis
. capture drop start_time
{txt}
{com}. capture drop end_time
{txt}
{com}. 
. bysort seqn: gen start_time = (_n - 1) * 2  // Start of each 2-year period
{txt}
{com}. bysort seqn: gen end_time = start_time + 2  // End of each 2-year period
{txt}
{com}. 
. * Step 3: Indicate event occurrence in each period
. capture drop event
{txt}
{com}. 
. gen event = (_d == 1 & _t <= end_time & _t > start_time)
{txt}
{com}. 
. * Step 4: Create dummy variables for each 2-year interval
. gen interval = floor(start_time / 2) + 1  // Create interval number
{txt}
{com}. tabulate interval, generate(dummy)  // Generate dummy variables for each interval

   {txt}interval {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,537       13.69       13.69
{txt}          2 {c |}{res}      1,486       13.23       26.92
{txt}          3 {c |}{res}      1,401       12.48       39.40
{txt}          4 {c |}{res}      1,284       11.44       50.84
{txt}          5 {c |}{res}      1,186       10.56       61.40
{txt}          6 {c |}{res}      1,083        9.65       71.05
{txt}          7 {c |}{res}        980        8.73       79.77
{txt}          8 {c |}{res}        875        7.79       87.57
{txt}          9 {c |}{res}        772        6.88       94.44
{txt}         10 {c |}{res}        499        4.44       98.89
{txt}         11 {c |}{res}        125        1.11      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     11,228      100.00
{txt}
{com}. 
. 
. logistic _d dummy1-dummy10 AGE SEX NHB HISP OTHER zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm frailty_status zses  
{res}
{txt}{col 1}Logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:11,228}
{txt}{col 56}{lalign 13:LR chi2({res:22})}{col 69} = {res}{ralign 7:4100.29}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-5690.3862}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.2649}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             _d{col 17}{c |} Odds ratio{col 29}   Std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}dummy1 {c |}{col 17}{res}{space 2} 149.3649{col 29}{space 2} 151.4593{col 40}{space 1}    4.94{col 49}{space 3}0.000{col 57}{space 4} 20.46971{col 70}{space 3} 1089.897
{txt}{space 9}dummy2 {c |}{col 17}{res}{space 2} 143.1941{col 29}{space 2} 145.2074{col 40}{space 1}    4.90{col 49}{space 3}0.000{col 57}{space 4} 19.62257{col 70}{space 3} 1044.947
{txt}{space 9}dummy3 {c |}{col 17}{res}{space 2} 134.3803{col 29}{space 2} 136.2789{col 40}{space 1}    4.83{col 49}{space 3}0.000{col 57}{space 4} 18.41226{col 70}{space 3} 980.7624
{txt}{space 9}dummy4 {c |}{col 17}{res}{space 2} 120.9722{col 29}{space 2} 122.6971{col 40}{space 1}    4.73{col 49}{space 3}0.000{col 57}{space 4} 16.57092{col 70}{space 3} 883.1296
{txt}{space 9}dummy5 {c |}{col 17}{res}{space 2} 108.7648{col 29}{space 2} 110.3298{col 40}{space 1}    4.62{col 49}{space 3}0.000{col 57}{space 4} 14.89496{col 70}{space 3} 794.2139
{txt}{space 9}dummy6 {c |}{col 17}{res}{space 2} 92.93364{col 29}{space 2} 94.29123{col 40}{space 1}    4.47{col 49}{space 3}0.000{col 57}{space 4} 12.72146{col 70}{space 3}  678.905
{txt}{space 9}dummy7 {c |}{col 17}{res}{space 2} 75.31317{col 29}{space 2} 76.43815{col 40}{space 1}    4.26{col 49}{space 3}0.000{col 57}{space 4} 10.30279{col 70}{space 3} 550.5379
{txt}{space 9}dummy8 {c |}{col 17}{res}{space 2}   55.658{col 29}{space 2} 56.52292{col 40}{space 1}    3.96{col 49}{space 3}0.000{col 57}{space 4} 7.604988{col 70}{space 3} 407.3397
{txt}{space 9}dummy9 {c |}{col 17}{res}{space 2} 34.91824{col 29}{space 2} 35.50808{col 40}{space 1}    3.49{col 49}{space 3}0.000{col 57}{space 4} 4.758522{col 70}{space 3} 256.2315
{txt}{space 8}dummy10 {c |}{col 17}{res}{space 2} 17.05952{col 29}{space 2} 17.45647{col 40}{space 1}    2.77{col 49}{space 3}0.006{col 57}{space 4} 2.295934{col 70}{space 3} 126.7577
{txt}{space 12}AGE {c |}{col 17}{res}{space 2} 1.147785{col 29}{space 2} .0040498{col 40}{space 1}   39.07{col 49}{space 3}0.000{col 57}{space 4} 1.139875{col 70}{space 3}  1.15575
{txt}{space 12}SEX {c |}{col 17}{res}{space 2} .7211485{col 29}{space 2} .0376299{col 40}{space 1}   -6.26{col 49}{space 3}0.000{col 57}{space 4} .6510413{col 70}{space 3} .7988052
{txt}{space 12}NHB {c |}{col 17}{res}{space 2}  .880812{col 29}{space 2} .0596224{col 40}{space 1}   -1.87{col 49}{space 3}0.061{col 57}{space 4} .7713742{col 70}{space 3} 1.005776
{txt}{space 11}HISP {c |}{col 17}{res}{space 2} .4668811{col 29}{space 2} .0289424{col 40}{space 1}  -12.29{col 49}{space 3}0.000{col 57}{space 4} .4134658{col 70}{space 3} .5271971
{txt}{space 10}OTHER {c |}{col 17}{res}{space 2} .5664608{col 29}{space 2} .0749517{col 40}{space 1}   -4.30{col 49}{space 3}0.000{col 57}{space 4} .4370614{col 70}{space 3} .7341711
{txt}{space 1}zHorvathAgeEAA {c |}{col 17}{res}{space 2} .8953007{col 29}{space 2} .0323809{col 40}{space 1}   -3.06{col 49}{space 3}0.002{col 57}{space 4} .8340324{col 70}{space 3} .9610697
{txt}{space 2}zHannumAgeEAA {c |}{col 17}{res}{space 2} 1.180264{col 29}{space 2} .0422262{col 40}{space 1}    4.63{col 49}{space 3}0.000{col 57}{space 4} 1.100337{col 70}{space 3} 1.265996
{txt}{space 3}zPhenoAgeEAA {c |}{col 17}{res}{space 2} 1.049644{col 29}{space 2} .0383648{col 40}{space 1}    1.33{col 49}{space 3}0.185{col 57}{space 4} .9770807{col 70}{space 3} 1.127597
{txt}zGrimAgeMortEAA {c |}{col 17}{res}{space 2} 1.392089{col 29}{space 2} .0529483{col 40}{space 1}    8.70{col 49}{space 3}0.000{col 57}{space 4} 1.292086{col 70}{space 3} 1.499831
{txt}{space 3}zDunedinPoAm {c |}{col 17}{res}{space 2} 1.211939{col 29}{space 2}  .041331{col 40}{space 1}    5.64{col 49}{space 3}0.000{col 57}{space 4}  1.13358{col 70}{space 3} 1.295715
{txt}{space 1}frailty_status {c |}{col 17}{res}{space 2} 1.634149{col 29}{space 2} .1008581{col 40}{space 1}    7.96{col 49}{space 3}0.000{col 57}{space 4} 1.447959{col 70}{space 3}  1.84428
{txt}{space 11}zses {c |}{col 17}{res}{space 2} .7120218{col 29}{space 2} .0194966{col 40}{space 1}  -12.40{col 49}{space 3}0.000{col 57}{space 4} .6748164{col 70}{space 3} .7512784
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 1.30e-06{col 29}{space 2} 1.36e-06{col 40}{space 1}  -12.98{col 49}{space 3}0.000{col 57}{space 4} 1.68e-07{col 70}{space 3} .0000101
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. 
. sort seqn 
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETE",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETE.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETE",clear
{txt}
{com}. 
. capture rename _d d_var
{txt}
{com}. 
. keep AGE SEX NHB HISP OTHER d_var dummy* zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm frailty_status zses
{txt}
{com}. 
. order AGE  zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm frailty_status SEX d_var NHB HISP OTHER dummy1 dummy2 dummy3 dummy4 dummy5 dummy6 dummy7 dummy8 dummy9 dummy9 dummy10 dummy11 zses
{txt}
{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETEfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETEfin.dta{rm}
saved
{p_end}

{com}. 
. capture log close 
{smcl}
{com}{sf}{ul off}