{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. //STEP 15: HEATMAP FOR EACH TELOMERE LENGTH, EPIGENETIC CLOCKS VS. MORTALITY RISK, ADJUSTING AGE, SEX AND RACE: COX MODEL///
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. stset TIMEyears [pweight=exam_base_wt], id(HNDID) failure(DIED==1)

{txt}Survival-time data settings

{col 12}ID variable: {res}HNDID
{col 10}{txt}Failure event: {res}DIED==1
{col 1}{txt}Observed time interval: {res}(TIMEyears[_n-1], TIMEyears]
{col 6}{txt}Exit on or before: {res}failure
{col 17}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}{hline 74}
{res}      3,720{txt}  total observations
{res}        918{txt}  weights invalid {col 61}PROBABLE ERROR
{hline 74}
{res}      2,802{txt}  observations remaining, representing
{res}      2,802{txt}  subjects
{res}        715{txt}  failures in single-failure-per-subject data
{res}   40,239.7{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 18.39103
{txt}
{com}. 
. 
. * Install estout if not already installed
. ssc install estout, replace
{txt}checking {hilite:estout} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. * Clear any previous estimates
. est clear
{res}{txt}
{com}. 
. * Start the loop
. foreach x of varlist zHorvathAgeEAA zHannumAgeEAA zDunedinPACE zses frail  {c -(} 
{txt}  2{com}.     
.         * Run the stcox command
.         stcox `x' AGE SEX i.RACE if sample_final==1 
{txt}  3{com}.         
.         * Store the estimates
.         eststo output`x'
{txt}  4{com}.     {c )-}

{col 9}{txt}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}HNDID
{col 13}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}(sum of wgt is 40,154.9825277328)
Iteration 0:  Log pseudolikelihood = {res}-66946.428
{txt}Iteration 1:  Log pseudolikelihood = {res}-65227.889
{txt}Iteration 2:  Log pseudolikelihood = {res}-65195.114
{txt}Iteration 3:  Log pseudolikelihood = {res}-65195.057
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-65195.057

{txt}Cox regression with no ties

No. of subjects = {res}{ralign 11:40,155}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:455}
{txt}No. of failures = {res}{ralign 11:6,436}
{txt}Time at risk    = {res}{ralign 11:633,721.085}
{col 57}{txt}{lalign 13:Wald chi2({res:4})} = {res}{ralign 6:19.40}
{txt}Log pseudolikelihood = {res}-65195.057{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0007}

{txt}{ralign 80:(Std. err. adjusted for {res:455} clusters in {res:HNDID})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}            _t{col 16}{c |} Haz. ratio{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zHorvathAgeEAA {c |}{col 16}{res}{space 2}  .948026{col 28}{space 2}  .144259{col 39}{space 1}   -0.35{col 48}{space 3}0.726{col 56}{space 4} .7035498{col 69}{space 3} 1.277455
{txt}{space 11}AGE {c |}{col 16}{res}{space 2} 1.088153{col 28}{space 2} .0241088{col 39}{space 1}    3.81{col 48}{space 3}0.000{col 56}{space 4} 1.041912{col 69}{space 3} 1.136446
{txt}{space 11}SEX {c |}{col 16}{res}{space 2} .6665484{col 28}{space 2} .1991529{col 39}{space 1}   -1.36{col 48}{space 3}0.175{col 56}{space 4} .3711143{col 69}{space 3}  1.19717
{txt}{space 8}1.RACE {c |}{col 16}{res}{space 2} .8915784{col 28}{space 2} .2598397{col 39}{space 1}   -0.39{col 48}{space 3}0.694{col 56}{space 4} .5036017{col 69}{space 3} 1.578454
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}HNDID
{col 13}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}(sum of wgt is 40,154.9825277328)
Iteration 0:  Log pseudolikelihood = {res}-66946.428
{txt}Iteration 1:  Log pseudolikelihood = {res}-64907.735
{txt}Iteration 2:  Log pseudolikelihood = {res}-64858.176
{txt}Iteration 3:  Log pseudolikelihood = {res} -64858.16
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res} -64858.16

{txt}Cox regression with no ties

No. of subjects = {res}{ralign 11:40,155}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:455}
{txt}No. of failures = {res}{ralign 11:6,436}
{txt}Time at risk    = {res}{ralign 11:633,721.085}
{col 57}{txt}{lalign 13:Wald chi2({res:4})} = {res}{ralign 6:18.60}
{txt}Log pseudolikelihood = {res}-64858.16{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0009}

{txt}{ralign 79:(Std. err. adjusted for {res:455} clusters in {res:HNDID})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}           _t{col 15}{c |} Haz. ratio{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zHannumAgeEAA {c |}{col 15}{res}{space 2} 1.371185{col 27}{space 2} .1886037{col 38}{space 1}    2.30{col 47}{space 3}0.022{col 55}{space 4} 1.047165{col 68}{space 3} 1.795466
{txt}{space 10}AGE {c |}{col 15}{res}{space 2} 1.091487{col 27}{space 2} .0237441{col 38}{space 1}    4.02{col 47}{space 3}0.000{col 55}{space 4} 1.045927{col 68}{space 3} 1.139031
{txt}{space 10}SEX {c |}{col 15}{res}{space 2}  .776072{col 27}{space 2} .2243589{col 38}{space 1}   -0.88{col 47}{space 3}0.381{col 55}{space 4} .4403759{col 68}{space 3} 1.367667
{txt}{space 7}1.RACE {c |}{col 15}{res}{space 2} .9600716{col 27}{space 2} .2684738{col 38}{space 1}   -0.15{col 47}{space 3}0.884{col 55}{space 4}  .554976{col 68}{space 3}  1.66086
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}HNDID
{col 13}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}(sum of wgt is 40,154.9825277328)
Iteration 0:  Log pseudolikelihood = {res}-66946.428
{txt}Iteration 1:  Log pseudolikelihood = {res}-64430.313
{txt}Iteration 2:  Log pseudolikelihood = {res}-64393.642
{txt}Iteration 3:  Log pseudolikelihood = {res}-64393.581
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-64393.581

{txt}Cox regression with no ties

No. of subjects = {res}{ralign 11:40,155}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:455}
{txt}No. of failures = {res}{ralign 11:6,436}
{txt}Time at risk    = {res}{ralign 11:633,721.085}
{col 57}{txt}{lalign 13:Wald chi2({res:4})} = {res}{ralign 6:24.54}
{txt}Log pseudolikelihood = {res}-64393.581{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0001}

{txt}{ralign 78:(Std. err. adjusted for {res:455} clusters in {res:HNDID})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zDunedinPACE {c |}{col 14}{res}{space 2} 1.714591{col 26}{space 2} .2343424{col 37}{space 1}    3.94{col 46}{space 3}0.000{col 54}{space 4} 1.311663{col 67}{space 3} 2.241294
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} 1.083576{col 26}{space 2} .0238625{col 37}{space 1}    3.64{col 46}{space 3}0.000{col 54}{space 4} 1.037801{col 67}{space 3}  1.13137
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .6522477{col 26}{space 2} .2009809{col 37}{space 1}   -1.39{col 46}{space 3}0.165{col 54}{space 4} .3565553{col 67}{space 3} 1.193159
{txt}{space 6}1.RACE {c |}{col 14}{res}{space 2} .6519434{col 26}{space 2} .1868117{col 37}{space 1}   -1.49{col 46}{space 3}0.135{col 54}{space 4} .3717933{col 67}{space 3} 1.143189
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}HNDID
{col 13}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}(sum of wgt is 40,154.9825277328)
Iteration 0:  Log pseudolikelihood = {res}-66946.428
{txt}Iteration 1:  Log pseudolikelihood = {res}-63959.907
{txt}Iteration 2:  Log pseudolikelihood = {res}-63921.154
{txt}Iteration 3:  Log pseudolikelihood = {res} -63921.13
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res} -63921.13

{txt}Cox regression with no ties

No. of subjects = {res}{ralign 11:40,155}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:455}
{txt}No. of failures = {res}{ralign 11:6,436}
{txt}Time at risk    = {res}{ralign 11:633,721.085}
{col 57}{txt}{lalign 13:Wald chi2({res:4})} = {res}{ralign 6:64.13}
{txt}Log pseudolikelihood = {res}-63921.13{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{ralign 78:(Std. err. adjusted for {res:455} clusters in {res:HNDID})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}zses {c |}{col 14}{res}{space 2} .5422277{col 26}{space 2} .0637619{col 37}{space 1}   -5.21{col 46}{space 3}0.000{col 54}{space 4} .4306127{col 67}{space 3} .6827733
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} 1.088559{col 26}{space 2} .0223254{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4}  1.04567{col 67}{space 3} 1.133207
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .6745253{col 26}{space 2} .1957319{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4} .3819433{col 67}{space 3} 1.191235
{txt}{space 6}1.RACE {c |}{col 14}{res}{space 2} .8951161{col 26}{space 2} .2444236{col 37}{space 1}   -0.41{col 46}{space 3}0.685{col 54}{space 4} .5241399{col 67}{space 3} 1.528662
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}HNDID
{col 13}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}(sum of wgt is 40,154.9825277328)
Iteration 0:  Log pseudolikelihood = {res}-66946.428
{txt}Iteration 1:  Log pseudolikelihood = {res}-65236.346
{txt}Iteration 2:  Log pseudolikelihood = {res}-65185.294
{txt}Iteration 3:  Log pseudolikelihood = {res} -65185.19
{txt}Iteration 4:  Log pseudolikelihood = {res} -65185.19
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res} -65185.19

{txt}Cox regression with no ties

No. of subjects = {res}{ralign 11:40,155}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:455}
{txt}No. of failures = {res}{ralign 11:6,436}
{txt}Time at risk    = {res}{ralign 11:633,721.085}
{col 57}{txt}{lalign 13:Wald chi2({res:4})} = {res}{ralign 6:16.63}
{txt}Log pseudolikelihood = {res}-65185.19{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0023}

{txt}{ralign 78:(Std. err. adjusted for {res:455} clusters in {res:HNDID})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}frail {c |}{col 14}{res}{space 2} 1.271589{col 26}{space 2} .5601546{col 37}{space 1}    0.55{col 46}{space 3}0.585{col 54}{space 4} .5362651{col 67}{space 3} 3.015187
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} 1.086295{col 26}{space 2} .0240319{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4}   1.0402{col 67}{space 3} 1.134432
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .6758102{col 26}{space 2} .2046355{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4} .3733195{col 67}{space 3} 1.223401
{txt}{space 6}1.RACE {c |}{col 14}{res}{space 2} .8871397{col 26}{space 2} .2579216{col 37}{space 1}   -0.41{col 46}{space 3}0.680{col 54}{space 4} .5017863{col 67}{space 3}  1.56843
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. 
. * Export the results to a dataset
. esttab using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\results_TABLE5.csv", replace se ar2
{res}{txt}(output written to {browse  `"E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\results_TABLE5.csv"'})

{com}. 
. import delimited "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\results_TABLE5.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(6 vars, 24 obs)

{com}. 
. 
. * Convert the CSV file to a Stata dataset (if needed)
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\results_TABLE5.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\results_TABLE5.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. **Fix the dataset so it is simpler. This is saved as : cleaned_results_TABLE5_final.csv in the same folder**
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}