{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //STEP 1: EPIGENETIC CLOCK AND TELOMERE LENGTH DATA MANAGEMENT//
. 
. cd "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\RAW_DATA\HANDLS_DATA"
{res}E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\RAW_DATA\HANDLS_DATA
{txt}
{com}. 
. use 2025-08-04_SES_Frail
{txt}
{com}. sort HNDID
{txt}
{com}. save 2025-08-04_SES_Frail,replace
{txt}{p 0 4 2}
file {bf}
2025-08-04_SES_Frail.dta{rm}
saved
{p_end}

{com}. 
. use 2024-12-20_telo_epi,clear
{txt}
{com}. capture drop tLength
{txt}
{com}. sort HNDID
{txt}
{com}. save 2025-08-04_epiclocks_demo,replace
{txt}{p 0 4 2}
file {bf}
2025-08-04_epiclocks_demo.dta{rm}
saved
{p_end}

{com}. 
. use 2025-08-04_epiclocks_demo,clear
{txt}
{com}. merge HNDID using 2025-08-04_SES_Frail
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save 2025-08-06_frailSESepiclock,replace
{txt}{p 0 4 2}
file {bf}
2025-08-06_frailSESepiclock.dta{rm}
saved
{p_end}

{com}. 
. 
. use 2025-08-06_frailSESepiclock,clear
{txt}
{com}. capture rename HNDid HNDID
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2025-08-06_frailSESepiclock.dta{rm}
saved
{p_end}

{com}. 
. use Age_w1,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
Age_w1.dta{rm}
saved
{p_end}

{com}. 
. use exam_base_wt,clear
{txt}(Written by R.              )

{com}. capture rename hndid HNDID
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save exam_base_wt,replace
{txt}{p 0 4 2}
file {bf}
exam_base_wt.dta{rm}
saved
{p_end}

{com}. 
. use 2025-08-06_frailSESepiclock,clear
{txt}
{com}. merge HNDID using Age_w1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save 2025-08-06_frailSESepiclock,replace
{txt}{p 0 4 2}
file {bf}
2025-08-06_frailSESepiclock.dta{rm}
saved
{p_end}

{com}. merge HNDID using exam_base_wt
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. 
. 
. save HANDLS_MERGED_DATASET, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_MERGED_DATASET.dta{rm}
saved
{p_end}

{com}. 
. su 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      3,720      1860.5    1074.016          1       3720
{txt}{space 7}HNDID {c |}{res}      3,720    8.16e+09    4.20e+07   8.03e+09   8.22e+09
{txt}{space 9}Sex {c |}{res}      3,720    1.452957     .497849          1          2
{txt}{space 8}Race {c |}{res}      3,720     1.59086    .4917412          1          2
{txt}{space 1}DunedinPACE {c |}{res}        470    1.072991    .1408655   .5848409    1.55415
{txt}{hline 13}{c +}{hline 57}
DNAmAge_Ho~h {c |}{res}        470    48.42491    8.750509   23.61642    71.1201
{txt}DNAmAge_Ha~m {c |}{res}        470    48.70153    10.24755   22.62519   79.30316
{txt}{space 9}AGE {c |}{res}        470    48.70153    8.725696   30.18207   65.15264
{txt}{space 8}dead {c |}{res}      3,720    .2526882    .4346121          0          1
{txt}{space 6}ageout {c |}{res}      3,720    62.62654    9.274746   33.91376   82.63655
{txt}{hline 13}{c +}{hline 57}
{space 9}Age {c |}{res}      3,720    48.26927    9.357168       29.8       66.2
{txt}{space 5}HNDwave {c |}{res}      3,720           1           0          1          1
{txt}{space 5}PovStat {c |}{res}      3,720    1.412634    .4923743          1          2
{txt}{space 3}Education {c |}{res}      3,624     12.3074    3.005357          1         21
{txt}{space 7}frail {c |}{res}      2,815    1.101954    .3026413          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}frailIDX {c |}{res}      2,815    1.566963    .6705098          1          3
{txt}exam_base_wt {c |}{res}      3,720    72.87783    125.2398          0    1300.03
{txt}
{com}. 
. tab1 Sex Race dead

-> tabulation of Sex  

        {txt}Sex {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Women {c |}{res}      2,035       54.70       54.70
{txt}        Men {c |}{res}      1,685       45.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00

-> tabulation of Race  

       {txt}Race {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      White {c |}{res}      1,522       40.91       40.91
{txt}      AfrAm {c |}{res}      2,198       59.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00

-> tabulation of dead  

       {txt}dead {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,780       74.73       74.73
{txt}          1 {c |}{res}        940       25.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. 
. foreach var of varlist DunedinPACE DNAmAge_Horvath DNAmAge_Hannum {c -(}
{txt}  2{com}.         histogram `var'
{txt}  3{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_EPICLOCK_HIST`var'", replace
{txt}  4{com}. {c )-}
{txt}(bin={res}21{txt}, start={res}.58484089{txt}, width={res}.04615757{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_EPICLOCK_HISTDunedinPACE.gph} saved
(bin={res}21{txt}, start={res}23.616417{txt}, width={res}2.2620803{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_EPICLOCK_HISTDNAmAge_Horvath.gph} saved
(bin={res}21{txt}, start={res}22.625187{txt}, width={res}2.6989511{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_EPICLOCK_HISTDNAmAge_Hannum.gph} saved

{com}. 
. save, replace 
{txt}{p 0 4 2}
file {bf}
HANDLS_MERGED_DATASET.dta{rm}
saved
{p_end}

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //STEP 2: GENERATE EPIGENETIC AGE ACCELERATION VARIABLES FROM HORVATH, HANNUM, PHENO, GRIMM, include POA, remove Outliers and z-score//
. 
. capture drop HorvathAge
{txt}
{com}. gen HorvathAge=DNAmAge_Horvath
{txt}(3,250 missing values generated)

{com}. 
. capture drop HannumAge
{txt}
{com}. gen HannumAge=DNAmAge_Hannum
{txt}(3,250 missing values generated)

{com}. 
. capture drop DunedinPoAm
{txt}
{com}. gen DunedinPoAm=DunedinPACE
{txt}(3,250 missing values generated)

{com}. 
. su AGE if HorvathAge~=. & DNAmAge_Hannum~=.

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}AGE {c |}{res}        470    48.70153    8.725696   30.18207   65.15264
{txt}
{com}. histogram AGE if HorvathAge~=. & DNAmAge_Hannum~=. & DunedinPACE~=. 
{txt}(bin={res}21{txt}, start={res}30.18207{txt}, width={res}1.6652652{txt})
{res}{txt}
{com}. 
. capture drop HorvathAgeEAA 
{txt}
{com}. capture drop HannumAgeEAA 
{txt}
{com}. 
. foreach var of varlist HorvathAge HannumAge {c -(}
{txt}  2{com}.         
.         reg `var' AGE 
{txt}  3{com}.         predict `var'EAA, resid
{txt}  4{com}.         histogram `var'EAA
{txt}  5{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HIST`var'EAA.gph", replace
{txt}  6{com}.         su `var'EAA
{txt}  7{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       470
{txt}{hline 13}{c +}{hline 34}   F(1, 468)       = {res}  1226.32
{txt}       Model {c |} {res} 25992.4912         1  25992.4912   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9919.49966       468  21.1955121   {txt}R-squared       ={res}    0.7238
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7232
{txt}       Total {c |} {res} 35911.9908       469   76.571409   {txt}Root MSE        =   {res} 4.6039

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  HorvathAge{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2} .8531737{col 26}{space 2} .0243633{col 37}{space 1}   35.02{col 46}{space 3}0.000{col 54}{space 4} .8052987{col 67}{space 3} .9010486
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  6.87405{col 26}{space 2} 1.205382{col 37}{space 1}    5.70{col 46}{space 3}0.000{col 54}{space 4} 4.505419{col 67}{space 3} 9.242681
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(3,250 missing values generated)
(bin={res}21{txt}, start={res}-14.897246{txt}, width={res}1.3991047{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTHorvathAgeEAA.gph} saved

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
HorvathAge~A {c |}{res}        470   -1.14e-08    4.598948  -14.89725   14.48395

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       470
{txt}{hline 13}{c +}{hline 34}   F(1, 468)       = {res}  1234.05
{txt}       Model {c |} {res} 35708.6171         1  35708.6171   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 13542.1142       468  28.9361415   {txt}R-squared       ={res}    0.7250
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7244
{txt}       Total {c |} {res} 49250.7313       469   105.01222   {txt}Root MSE        =   {res} 5.3792

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   HannumAge{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2}        1{col 26}{space 2} .0284665{col 37}{space 1}   35.13{col 46}{space 3}0.000{col 54}{space 4} .9440621{col 67}{space 3} 1.055938
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.12e-07{col 26}{space 2}  1.40839{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-2.767552{col 67}{space 3} 2.767552
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(3,250 missing values generated)
(bin={res}21{txt}, start={res}-20.257854{txt}, width={res}1.7674341{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTHannumAgeEAA.gph} saved

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
HannumAgeEAA {c |}{res}        470   -8.91e-09    5.373495  -20.25785   16.85826
{txt}
{com}. 
. su DunedinPoAm

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}DunedinPoAm {c |}{res}        470    1.072991    .1408655   .5848409    1.55415
{txt}
{com}. histogram DunedinPoAm
{txt}(bin={res}21{txt}, start={res}.58484089{txt}, width={res}.04615757{txt})
{res}{txt}
{com}. graph save  "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTDunedinPoAmEAA.gph", replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTDunedinPoAmEAA.gph} saved

{com}.  
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. *******REMOVE OUTLIERS*************
. 
. local vars HorvathAgeEAA HannumAgeEAA  DunedinPoAm
{txt}
{com}. 
. foreach var of varlist `vars' {c -(}
{txt}  2{com}.     quietly summarize `var', detail
{txt}  3{com}.     local p25 = r(p25)
{txt}  4{com}.     local p75 = r(p75)
{txt}  5{com}.     local iqr = `p75' - `p25'
{txt}  6{com}. 
.     local lower_bound = `p25' - 4 * `iqr'
{txt}  7{com}.     local upper_bound = `p75' + 4 * `iqr'
{txt}  8{com}. 
.     gen `var'_no_outliers = `var'
{txt}  9{com}.     replace `var'_no_outliers = . if `var' < `lower_bound' | `var' > `upper_bound'
{txt} 10{com}. {c )-}
{txt}(3,250 missing values generated)
(0 real changes made)
(3,250 missing values generated)
(0 real changes made)
(3,250 missing values generated)
(0 real changes made)

{com}. 
. 
. 
. 
. *******Z-SCORE*************
. 
. capture drop zHorvathAgeEAA zHannumAgeEAA zDunedinPoAm
{txt}
{com}. foreach var of varlist HorvathAgeEAA_no_outliers HannumAgeEAA_no_outliers DunedinPoAm_no_outliers {c -(}
{txt}  2{com}.         
.         egen z`var'=std(`var')
{txt}  3{com}. {c )-}
{txt}(3,250 missing values generated)
(3,250 missing values generated)
(3,250 missing values generated)

{com}. 
. su z*

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
zHorvathAg~s {c |}{res}        470   -5.81e-10           1  -3.239273   3.149406
{txt}zHannumAge~s {c |}{res}        470    5.62e-10           1  -3.769959   3.137299
{txt}zDunedinPo~s {c |}{res}        470    2.05e-10           1  -3.465367    3.41573
{txt}
{com}. 
. capture rename z*no_outliers z*
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. foreach var of varlist zHorvathAgeEAA zHannumAgeEAA zDunedinPoAm {c -(}
{txt}  2{com}.         histogram `var'
{txt}  3{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HIST`var'.gph",replace
{txt}  4{com}.         
. {c )-}
{txt}(bin={res}21{txt}, start={res}-3.2392728{txt}, width={res}.30422279{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTzHorvathAgeEAA_.gph} saved
(bin={res}21{txt}, start={res}-3.769959{txt}, width={res}.32891706{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTzHannumAgeEAA_.gph} saved
(bin={res}21{txt}, start={res}-3.4653673{txt}, width={res}.32767129{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTzDunedinPoAm_.gph} saved

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. //STEP 8: COVARIATES//
. 
. 
. **RACE**
. 
. capture drop RACE
{txt}
{com}. gen RACE=.
{txt}(3,720 missing values generated)

{com}. replace RACE=1 if Race==2
{txt}(2,198 real changes made)

{com}. replace RACE=0 if Race==1
{txt}(1,522 real changes made)

{com}. 
. tab RACE

       {txt}RACE {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,522       40.91       40.91
{txt}          1 {c |}{res}      2,198       59.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **SEX**
. 
. tab Sex

        {txt}Sex {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Women {c |}{res}      2,035       54.70       54.70
{txt}        Men {c |}{res}      1,685       45.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. capture drop SEX
{txt}
{com}. gen SEX=.
{txt}(3,720 missing values generated)

{com}. replace SEX=1 if Sex==1
{txt}(2,035 real changes made)

{com}. replace SEX=0 if Sex==2
{txt}(1,685 real changes made)

{com}. 
. **SEX
. **0: Male
. **1: Female
. 
. tab SEX

        {txt}SEX {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,685       45.30       45.30
{txt}          1 {c |}{res}      2,035       54.70      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **SES**
. capture drop ses
{txt}
{com}. pca PovStat Education,factors(1)

{txt}Principal components/correlation{col 50}Number of obs    = {res}     3,624
{col 50}{txt}Number of comp.  = {res}         1
{col 50}{txt}Trace            {col 67}=  {res}        2
{col 5}{txt}Rotation: (unrotated = principal){col 50}Rho              = {res}    0.6155

{txt}{col 5}{hline 13}{c TT}{hline 60}
{col 5}   Component {c |}   Eigenvalue   Difference         Proportion   Cumulative
{col 5}{hline 13}{c +}{hline 60}
{col 5}{ralign 12:Comp1} {c |}{res}      1.23109      .462174             0.6155       0.6155
{txt}{col 5}{ralign 12:Comp2} {c |}{res}      .768913            .             0.3845       1.0000
{txt}{col 5}{hline 13}{c BT}{hline 60}

Principal components (eigenvectors) 

{space 4}{hline 13}{c  TT}{hline 10}{c  TT}{hline 13}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Comp1}{space 1}{c |}{space 1}{ralign 11:Unexplained}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{c   +}{hline 13}
{space 4}{space 0}{ralign 12:PovStat}{space 1}{c |}{space 1}{ralign 8:{res:{sf: -0.7071}}}{space 1}{c |}{space 1}{center 11:{res:{sf:      .3845}}}{space 1}
{space 4}{space 0}{ralign 12:Education}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.7071}}}{space 1}{c |}{space 1}{center 11:{res:{sf:      .3845}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{c  BT}{hline 13}

{com}. rotate

{txt}Principal components/correlation{col 50}Number of obs    = {res}     3,624
{col 50}{txt}Number of comp.  = {res}         1
{col 50}{txt}Trace            {col 67}=  {res}        2
{col 5}{txt}Rotation: orthogonal varimax (Kaiser off){col 50}Rho              = {res}    0.6155

{txt}{col 5}{hline 13}{c TT}{hline 60}
{col 5}   Component {c |}     Variance   Difference         Proportion   Cumulative
{col 5}{hline 13}{c +}{hline 60}
{col 5}{ralign 12:Comp1} {c |}{res}      1.23109            .             0.6155       0.6155
{txt}{col 5}{hline 13}{c BT}{hline 60}

Rotated components 

{space 4}{hline 13}{c  TT}{hline 10}{c  TT}{hline 13}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Comp1}{space 1}{c |}{space 1}{ralign 11:Unexplained}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{c   +}{hline 13}
{space 4}{space 0}{ralign 12:PovStat}{space 1}{c |}{space 1}{ralign 8:{res:{sf: -0.7071}}}{space 1}{c |}{space 1}{center 11:{res:{sf:      .3845}}}{space 1}
{space 4}{space 0}{ralign 12:Education}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.7071}}}{space 1}{c |}{space 1}{center 11:{res:{sf:      .3845}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{c  BT}{hline 13}

Component rotation matrix

{space 4}{hline 13}{c  TT}{hline 10}
{space 4}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 8:Comp1}{space 1}
{space 4}{hline 13}{c   +}{hline 10}
{space 4}{space 0}{ralign 12:Comp1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  1.0000}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}

{com}. predict ses
{txt}({bf:score} assumed)

Scoring coefficients for orthogonal varimax rotation
{col 5}sum of squares(column-loading) = 1

{space 4}{hline 13}{c  TT}{hline 10}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Comp1}{space 1}
{space 4}{hline 13}{c   +}{hline 10}
{space 4}{space 0}{ralign 12:PovStat}{space 1}{c |}{space 1}{ralign 8:{res:{sf: -0.7071}}}{space 1}
{space 4}{space 0}{ralign 12:Education}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.7071}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}

{com}. 
. capture drop zses
{txt}
{com}. egen zses=std(ses)
{txt}(96 missing values generated)

{com}. 
. 
. 
. **FRAILTY**
. su frailIDX

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}frailIDX {c |}{res}      2,815    1.566963    .6705098          1          3
{txt}
{com}. 
. capture drop frail_score
{txt}
{com}. gen frail_score=frailIDX
{txt}(905 missing values generated)

{com}. recode frail_score 1=0 2=1 3=2
{txt}(2,815 changes made to {bf:frail_score})

{com}. 
. 
. capture frailty
{txt}
{com}. gen frailty=frail
{txt}(905 missing values generated)

{com}. recode frailty 1=0 2=1
{txt}(2,815 changes made to {bf:frailty})

{com}. tab frailty

    {txt}frailty {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,528       89.80       89.80
{txt}          1 {c |}{res}        287       10.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,815      100.00
{txt}
{com}. 
. 
. **COHORT VARIABLE**
. 
. capture drop COHORT
{txt}
{com}. gen COHORT=3
{txt}
{com}. 
. tab COHORT

     {txt}COHORT {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. capture rename  zHorvathAgeEAA_ zHorvathAgeEAA
{txt}
{com}. 
. capture rename zHannumAgeEAA_ zHannumAgeEAA
{txt}
{com}. 
. capture rename zDunedinPoAm_ zDunedinPoAm
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. 
. //STEP 9: SET UP DATASET AS SURVIVAL DATA//
. 
. 
. **Age at death**
. capture drop Age_follow
{txt}
{com}. gen  Age_follow=ageout
{txt}
{com}. 
. su Age_follow,det

                         {txt}Age_follow
{hline 61}
      Percentiles      Smallest
 1%    {res} 44.85968       33.91376
{txt} 5%    {res} 47.58111       34.12731
{txt}10%    {res} 50.04517       34.45311       {txt}Obs         {res}      3,720
{txt}25%    {res} 55.38125       34.49966       {txt}Sum of wgt. {res}      3,720

{txt}50%    {res} 62.83915                      {txt}Mean          {res} 62.62654
                        {txt}Largest       Std. dev.     {res} 9.274746
{txt}75%    {res} 69.88912       82.58453
{txt}90%    {res} 75.06366       82.58727       {txt}Variance      {res} 86.02091
{txt}95%    {res} 77.88638       82.60096       {txt}Skewness      {res}-.0552172
{txt}99%    {res} 80.45996       82.63655       {txt}Kurtosis      {res} 2.232437
{txt}
{com}. histogram Age_follow
{txt}(bin={res}35{txt}, start={res}33.913757{txt}, width={res}1.3920798{txt})
{res}{txt}
{com}. 
. **Died**
. capture drop DIED
{txt}
{com}. gen DIED=1 if dead==1
{txt}(2,780 missing values generated)

{com}. replace DIED=0 if dead==0
{txt}(2,780 real changes made)

{com}. 
. tab DIED

       {txt}DIED {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,780       74.73       74.73
{txt}          1 {c |}{res}        940       25.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **Demographics**
. tab Sex

        {txt}Sex {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Women {c |}{res}      2,035       54.70       54.70
{txt}        Men {c |}{res}      1,685       45.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. tab Race

       {txt}Race {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      White {c |}{res}      1,522       40.91       40.91
{txt}      AfrAm {c |}{res}      2,198       59.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. su Age

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}Age {c |}{res}      3,720    48.26927    9.357168       29.8       66.2
{txt}
{com}. 
. 
. **Time of follow-up in years**
. capture drop TIMEyears
{txt}
{com}. gen TIMEyears=Age_follow-Age
{txt}
{com}. 
. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. stset TIMEyears [pweight=exam_base_wt], id(HNDID) failure(DIED==1)

{txt}Survival-time data settings

{col 12}ID variable: {res}HNDID
{col 10}{txt}Failure event: {res}DIED==1
{col 1}{txt}Observed time interval: {res}(TIMEyears[_n-1], TIMEyears]
{col 6}{txt}Exit on or before: {res}failure
{col 17}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}{hline 74}
{res}      3,720{txt}  total observations
{res}        918{txt}  weights invalid {col 61}PROBABLE ERROR
{hline 74}
{res}      2,802{txt}  observations remaining, representing
{res}      2,802{txt}  subjects
{res}        715{txt}  failures in single-failure-per-subject data
{res}   40,239.7{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 18.39103
{txt}
{com}. 
. 
. //STEP 10: STUDY SAMPLE SELECTION STEP, INVERSE MILLS RATIO, USING AGE>=50Y RESTRICTION//
. 
. **LARGEST HANDLS SAMPLE**
. 
. capture drop sample1
{txt}
{com}. gen sample1=.
{txt}(3,720 missing values generated)

{com}. replace sample1=1 if Age~=.
{txt}(3,720 real changes made)

{com}. replace sample1=0 if sample1~=1
{txt}(0 real changes made)

{com}. 
. tab sample1   

    {txt}sample1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **FRAILTY DATA AVAILABLE**
. 
. capture drop sample2
{txt}
{com}. gen sample2=.
{txt}(3,720 missing values generated)

{com}. replace sample2=1 if frail~=.
{txt}(2,815 real changes made)

{com}. replace sample2=0 if sample2~=1
{txt}(905 real changes made)

{com}. 
. tab sample2  

    {txt}sample2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        905       24.33       24.33
{txt}          1 {c |}{res}      2,815       75.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. 
. **EPIGENETIC CLOCK DATA AVAILABLE**
. 
. capture drop sample3
{txt}
{com}. gen sample3=.
{txt}(3,720 missing values generated)

{com}. replace sample3=1 if zHorvathAgeEAA~=. & zHannumAgeEAA~=. & zDunedinPoAm~=.
{txt}(470 real changes made)

{com}. replace sample3=0 if sample3~=1
{txt}(3,250 real changes made)

{com}. 
. tab sample3  

    {txt}sample3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,250       87.37       87.37
{txt}          1 {c |}{res}        470       12.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **EPIGENETIC CLOCK AND FRAILTY DATA AVAILABLE **
. 
. 
. capture drop sample4
{txt}
{com}. gen sample4=.
{txt}(3,720 missing values generated)

{com}. replace sample4=1 if sample3==1 & sample2==1
{txt}(466 real changes made)

{com}. replace sample4=0 if sample4~=1
{txt}(3,254 real changes made)

{com}. 
. tab sample4

    {txt}sample4 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,254       87.47       87.47
{txt}          1 {c |}{res}        466       12.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. ***SES covariate exclusion***
. capture drop sample5
{txt}
{com}. gen sample5=.
{txt}(3,720 missing values generated)

{com}. replace sample5=1 if sample4==1 & sample3==1 & sample2==1 & zses~=.
{txt}(455 real changes made)

{com}. replace sample5=0 if sample5~=1
{txt}(3,265 real changes made)

{com}. 
. tab sample5

    {txt}sample5 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,265       87.77       87.77
{txt}          1 {c |}{res}        455       12.23      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. 
. capture drop sample_final
{txt}
{com}. gen sample_final=sample5
{txt}
{com}. 
. 
. tab sample_final

{txt}sample_fina {c |}
          l {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,265       87.77       87.77
{txt}          1 {c |}{res}        455       12.23      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. **Inverse mills ratio**
. 
. xi:probit sample_final Age SEX i.RACE
{txt}i.RACE{col 19}_IRACE_0-1{col 39}(naturally coded; _IRACE_0 omitted)

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-1382.0022}  
Iteration 1:{space 2}Log likelihood = {res:-1371.4538}  
Iteration 2:{space 2}Log likelihood = {res:-1371.4384}  
Iteration 3:{space 2}Log likelihood = {res:-1371.4384}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:3,720}
{txt}{col 57}{lalign 13:LR chi2({res:3})}{col 70} = {res}{ralign 6:21.13}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0001}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1371.4384}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0076}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sample_final{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}Age {c |}{col 14}{res}{space 2} .0031478{col 26}{space 2} .0028766{col 37}{space 1}    1.09{col 46}{space 3}0.274{col 54}{space 4}-.0024902{col 67}{space 3} .0087858
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.1393029{col 26}{space 2} .0532401{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-.2436517{col 67}{space 3}-.0349542
{txt}{space 4}_IRACE_1 {c |}{col 14}{res}{space 2}  -.19358{col 26}{space 2} .0534668{col 37}{space 1}   -3.62{col 46}{space 3}0.000{col 54}{space 4} -.298373{col 67}{space 3} -.088787
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.133422{col 26}{space 2} .1477153{col 37}{space 1}   -7.67{col 46}{space 3}0.000{col 54}{space 4}-1.422939{col 67}{space 3}-.8439057
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. capture drop p1fin
{txt}
{com}. predict p1fin, xb
{txt}
{com}. 
. capture drop phifin
{txt}
{com}. capture drop caphifin
{txt}
{com}. capture drop invmillsfin
{txt}
{com}. 
. gen phifin=(1/sqrt(2*_pi))*exp(-(p1fin^2/2))
{txt}
{com}. 
. egen caphifin=std(p1fin)
{txt}
{com}. 
. capture drop invmillsfin
{txt}
{com}. gen invmillsfin=phifin/caphifin
{txt}
{com}. 
. 
. su invmillsfin

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}invmillsfin {c |}{res}      3,720   -.4305321    17.92057  -364.4588    358.947
{txt}
{com}. histogram invmillsfin
{txt}(bin={res}35{txt}, start={res}-364.45877{txt}, width={res}20.668736{txt})
{res}{txt}
{com}. 
. 
. ***************Z-SCORE AGAIN WITHIN FINAL SAMPLE****
. 
. *******Z-SCORE*************
. 
. capture drop zHorvathAgeEAA zHannumAgeEAA zDunedinPoAm zses
{txt}
{com}. foreach var of varlist HorvathAgeEAA_no_outliers HannumAgeEAA_no_outliers DunedinPoAm_no_outliers ses {c -(}
{txt}  2{com}.         
.         egen z`var'=std(`var') if sample_final==1
{txt}  3{com}. {c )-}
{txt}(3,265 missing values generated)
(3,265 missing values generated)
(3,265 missing values generated)
(3,265 missing values generated)

{com}. 
. su z*

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
zHorvathAg~s {c |}{res}        455   -1.43e-09           1  -3.232263   3.115893
{txt}zHannumAge~s {c |}{res}        455    1.42e-09           1  -3.736824   3.131512
{txt}zDunedinPo~s {c |}{res}        455    2.20e-09           1  -3.446494   3.414026
{txt}{space 8}zses {c |}{res}        455    4.73e-09           1  -2.906072   2.428349
{txt}
{com}. 
. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}