{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //STEP 12: CORRELATION MATRIX BETWEEN EPIGENTIC AGE ACCELERATION, EPIGENETIC CLOCKS, SES AND FRAIL VARIABLES//
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. capture rename zHorvathAgeEAA_no_outliers zHorvathAgeEAA
{txt}
{com}. capture rename zHannumAgeEAA_no_outliers zHannumAgeEAA
{txt}
{com}. capture rename zDunedinPoAm_no_outliers zDunedinPACE
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. // Step 1: Run the correlation command and save the matrix
. corr zHorvathAgeEAA zHannumAgeEAA zDunedinPACE zses frail_score
{txt}(obs=455)

             {c |} zHorva~A zHannu~A zDuned~E     zses frail_~e
{hline 13}{c +}{hline 45}
zHorvathAg~A {c |}{res}   1.0000
{txt}zHannumAge~A {c |}{res}   0.5037   1.0000
{txt}zDunedinPACE {c |}{res}   0.1153   0.1862   1.0000
        {txt}zses {c |}{res}   0.0363  -0.0927  -0.2599   1.0000
 {txt}frail_score {c |}{res}  -0.0294   0.0235   0.1679  -0.1985   1.0000

{txt}
{com}. matrix C = r(C)
{txt}
{com}. 
. // Step 2: Clear the current dataset (optional if you don't need it)
. clear
{txt}
{com}. 
. // Step 3: Convert the matrix to a dataset with unique variable names
. svmat C, names(col)
{txt}number of observations will be reset to 5
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 5.
{p_end}

{com}. 
. // Step 4: Save the dataset as a CSV file
. export delimited using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\OUTPUT\HANDLS_correlation_matrix.csv", replace
{res}{txt}{p 0 4 2}
(file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\OUTPUT\HANDLS_correlation_matrix.csv{rm}
not found)
{p_end}
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\OUTPUT\HANDLS_correlation_matrix.csv} saved

{com}. 
. **Add a column in excel sheet and re-type labels mannually. Change labels as needed. 
. 
. 
. // Step 5: Reload your original dataset if needed
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_FRAILTY_EPICLOCKS_MORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}